import React from 'react';
import { Col, Container, Row } from 'react-bootstrap';

const Blog = () => {
    return (
        <div>
            <Container>
                <Row>
                    <Col md="4">
                        <h1>Contex  Api কি জিনিস ? </h1>
                        <p>contex Api বলতে বজায়। আমরা যদি প্রপ্স এর মাধ্যমে প্যারেন্ট কম্পোনেন্টস থেকে চাইল্ড কম্পোনেন্টস এ ডাটা পাঠাতে বার বার প্রপ্স লিখে পাঠাতে হয়। যা অনেক জামেলা। আর এই সমস্যা সমাধানে জন্য কন্টেক্স এপিআই বেবহার করতে পারি। যা ট্রি এর মথ ডাটা কোনো প্যারেন্ট কম্পোনেন্টস থেকে সরাসরি চাইল্ড কম্পোনেন্টস এক্সেস করতে পারে </p>
                    </Col>
                    <Col md="4">
                        <h1>Semantic Tag  কি জিনিস ?  </h1>
                        <p>semantic tag বলতে বোঝায়,  যে ট্যাগ দেখলেই বোজতে পারি এর ভিতরে কি তাকতে পারে। যেমন img tag , table tag, footer tag etc। আবার নন সেমান্টিক ট্যাগ বলতে বজায় যে ট্যাগ দেখলে বাজার উপায় নেই অচ্যুয়াললি এর বিথরে কি তাকবে|  যেমন span tag div tag etc। ডেভেলপার দেড় বিভিন্ন অংশ কে ডিফাইন করতে এসব সিমান্টিক অনেক বোরো ভূমিকা পালন করে| </p>
                    </Col>
                </Row>
            </Container>
        </div>
    );
};

export default Blog;